In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("./Social_Network_Ads.csv")

In [3]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
dataset.drop("User ID",axis=1, inplace=True)

In [5]:
dataset.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [6]:
sex = pd.get_dummies(dataset["Gender"],drop_first=True)

In [7]:
sex.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [8]:
X = dataset.iloc[:,0:3]
X.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [9]:
Y = dataset.iloc[:,-1]
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [10]:
X = pd.concat([X,sex],axis=1)
X.head()

   Gender  Age  EstimatedSalary  Male
0    Male   19            19000     1
1    Male   35            20000     1
2  Female   26            43000     0
3  Female   27            57000     0
4    Male   19            76000     1

In [11]:
X.drop("Gender",axis=1,inplace=True)
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [13]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,random_state = 42, test_size = 1/3)

In [16]:
from sklearn.naive_bayes import GaussianNB
classifier = GaussianNB()
classifier.fit(X_train,y_train)

GaussianNB(priors=None)

In [17]:
predictions = classifier.predict(X_test)

In [18]:
from sklearn.metrics import accuracy_score
accuracy_score(predictions, y_test)

0.8955223880597015

In [19]:
from sklearn.metrics import confusion_matrix
confusion_matrix(predictions, y_test)

array([[80, 13],
       [ 1, 40]])

In [20]:
from sklearn.metrics import classification_report
classification_report(predictions, y_test)

'             precision    recall  f1-score   support\n\n          0       0.99      0.86      0.92        93\n          1       0.75      0.98      0.85        41\n\navg / total       0.92      0.90      0.90       134\n'